app/controllers/school_classes_controller.rb

  def create
    @class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
    @class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "qwe"], ["room_number", 12]]